IRP/src/Enums/IntegrationType/IntegrationType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>IntegrationType</name>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>CurrencyRates</name>
  </enumValues>
  <enumValues>
    <name>FileStorage</name>
  </enumValues>
  <enumValues>
    <name>ScriptStorage</name>
  </enumValues>
  <enumValues>
    <name>LocalFileStorage</name>
  </enumValues>
  <enumValues>
    <name>GoogleDrive</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/IntegrationSettings/IntegrationSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>IntegrationSettings</name>
  <attributes>
    <name>ExternalDataProc</name>
    <type>
      <types>CatalogRef.ExternalDataProc</types>
    </type>
  </attributes>
  <attributes>
    <name>IntegrationType</name>
    <type>
      <types>EnumRef.IntegrationType</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalDataProcSettings</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ConnectionSetting</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Files/Files.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Files</name>
  <attributes>
    <name>Volume</name>
    <type>
      <types>CatalogRef.FileStorageVolumes</types>
    </type>
  </attributes>
  <attributes>
    <name>URI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FileID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SizeBytes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Preview1URI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Extension</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

IRP/src/CommonForms/PictureGalleryForm/Module.bsl
&AtClient
Procedure OnOpen(Cancel)
	HTMLGallery = PictureViewerServer.HTMLGallery();
EndProcedure


&AtServerNoContext
Function GetPicturesRefs()
	Query = New Query();
	Query.Text =
		"SELECT TOP 1000
		|	Files.Ref,
		|	Files.Description,
		|	Files.FileID,
		|	NOT Files.Volume = VALUE(Catalog.IntegrationSettings.EmptyRef) AS isFilledVolume,
		|	Files.Volume.GETIntegrationSettings AS GETIntegrationSettings,
		|	Files.Volume.UsePreview1 AS UsePreview1,
		|	Files.Volume.Preview1GETIntegrationSettings AS Preview1GETIntegrationSettings,
		|	Files.Volume.GETIntegrationSettings.IntegrationType = VALUE(Enum.IntegrationType.LocalFileStorage) AS
		|		isLocalPictureURL,
		|	Files.Volume.Preview1GETIntegrationSettings.IntegrationType = VALUE(Enum.IntegrationType.LocalFileStorage) AS
		|		isLocalPreview1URL,
		|	Files.URI,
		|	Files.Preview1URI
		|FROM
		|	Catalog.Files AS Files
		|WHERE
		|	NOT Files.DeletionMark";
	ArrayOfResult = New Array();
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	While QuerySelection.Next() Do
		Map = New Structure("ID, Src, Name, Preview");
		PicInfo = PictureViewerServer.GetPictureURL(QuerySelection);
		Map.Src = PicInfo.PictureURL;
		If PicInfo.isLocalPictureURL Then
//			Map.SrcBD = New BinaryData(Map.Src);
		EndIf;
		Map.Preview = PicInfo.Preview1URL;
		If PicInfo.isLocalPreview1URL Then
//			Map.PreviewBD = New BinaryData(Map.Preview);
		EndIf;
		Map.ID = QuerySelection.FileID;
		Map.Name = QuerySelection.Description;
		ArrayOfResult.Add(Map);
	EndDo;
	
	Map = New Structure;
	Map.Insert("Pictures", ArrayOfResult);
	
	Return Map;
EndFunction

&AtClient
Procedure HTMLGalleryDocumentComplete(Item)
	HTMLWindow = PictureViewerClient.InfoDocumentComplete(Item);
	GetPictures = GetPicturesRefs();
	JSON = CommonFunctionsServer.SerializeJSON(GetPictures);
	HTMLWindow.fillImageGallery(JSON);
EndProcedure

&AtClient
Procedure HTMLGalleryOnClick(Item, EventData, StandardProcessing)
	StandardProcessing = True;
	If EventData.event = Undefined Then
		Return;
	EndIf;
	
	If EventData.Event.propertyName = "call1C" Then
//		EventData.Event.Data
	A = 1;
	s=A;
	EndIf;
EndProcedure
